In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('data/lab5warmupdata.txt', delimiter='\t')

In [3]:
df.head()

  number1  number2
0   0,589  '0,589'
1   0,578  '0,578'
2   7,779  '7,779'
3   0,139  '0,139'
4   1,687  '1,687'

In [4]:
type(df['number2'][0])

str

####Exercise 1: Strip the extra comma from the number1 column and convert to integer

In [5]:
# #Your code here
# df['number1'] = df['number1'].apply(lambda x: x.replace(',', '')).astype(int)
# df.number1

0      589
1      578
2     7779
3      139
4     1687
5     3246
6      254
7     3133
8     9446
9     6241
10    4922
11    4657
12    5134
13    4947
14    5988
15    1376
16     291
17    1515
18    3126
19     853
20    2768
21    6738
22    8168
23     181
24    6760
25    2199
26    2207
27    5145
28    8247
29    7646
30     941
31    1886
32    4981
33    2140
34    6987
35     326
36    2867
37    4890
38    8625
39    4475
40     903
Name: number1, dtype: int64

In [5]:
def replace_comma(x):
    return x.replace(",","")
df.number1.apply(replace_comma)

0     0589
1     0578
2     7779
3     0139
4     1687
5     3246
6     0254
7     3133
8     9446
9     6241
10    4922
11    4657
12    5134
13    4947
14    5988
15    1376
16    0291
17    1515
18    3126
19    0853
20    2768
21    6738
22    8168
23    0181
24    6760
25    2199
26    2207
27    5145
28    8247
29    7646
30    0941
31    1886
32    4981
33    2140
34    6987
35    0326
36    2867
37    4890
38    8625
39    4475
40    0903
Name: number1, dtype: object

In [7]:
df.number1= df.number1.apply(replace_comma)
df.number1

0     0589
1     0578
2     7779
3     0139
4     1687
5     3246
6     0254
7     3133
8     9446
9     6241
10    4922
11    4657
12    5134
13    4947
14    5988
15    1376
16    0291
17    1515
18    3126
19    0853
20    2768
21    6738
22    8168
23    0181
24    6760
25    2199
26    2207
27    5145
28    8247
29    7646
30    0941
31    1886
32    4981
33    2140
34    6987
35    0326
36    2867
37    4890
38    8625
39    4475
40    0903
Name: number1, dtype: object

In [14]:
df

   number1  number2
0     0589  '0,589'
1     0578  '0,578'
2     7779  '7,779'
3     0139  '0,139'
4     1687  '1,687'
5     3246  '3,246'
6     0254  '0,254'
7     3133  '3,133'
8     9446  '9,446'
9     6241  '6,241'
10    4922  '4,922'
11    4657  '4,657'
12    5134  '5,134'
13    4947  '4,947'
14    5988  '5,988'
15    1376  '1,376'
16    0291  '0,291'
17    1515  '1,515'
18    3126  '3,126'
19    0853  '0,853'
20    2768  '2,768'
21    6738  '6,738'
22    8168  '8,168'
23    0181  '0,181'
24    6760  '6,760'
25    2199  '2,199'
26    2207  '2,207'
27    5145  '5,145'
28    8247  '8,247'
29    7646  '7,646'
30    0941  '0,941'
31    1886  '1,886'
32    4981  '4,981'
33    2140  '2,140'
34    6987  '6,987'
35    0326  '0,326'
36    2867  '2,867'
37    4890  '4,890'
38    8625  '8,625'
39    4475  '4,475'
40    0903  '0,903'

In [22]:
type(df.number1[0])

numpy.int64

In [18]:
df.number1[1].lstrip(',')

'0589'

In [14]:
type(df.number1)

pandas.core.series.Series

In [ ]:
#Bonus: Do it a different way

In [30]:
def remove_comma(x):
    x = x.replace(",","")
    x = x.replace("'","") ## could we have done this in a single line?
    return x

In [31]:
df.number2.apply(remove_comma) ## "apply" applies to every element of the series

0     0589
1     0578
2     7779
3     0139
4     1687
5     3246
6     0254
7     3133
8     9446
9     6241
10    4922
11    4657
12    5134
13    4947
14    5988
15    1376
16    0291
17    1515
18    3126
19    0853
20    2768
21    6738
22    8168
23    0181
24    6760
25    2199
26    2207
27    5145
28    8247
29    7646
30    0941
31    1886
32    4981
33    2140
34    6987
35    0326
36    2867
37    4890
38    8625
39    4475
40    0903
Name: number2, dtype: object

In [36]:
## "Apply" NOT apply to every columns. You have to specify the column.
## Or you could use "applymap" which applies to a dataframe.
df.applymap(remove_comma)

   number1 number2
0     0589    0589
1     0578    0578
2     7779    7779
3     0139    0139
4     1687    1687
5     3246    3246
6     0254    0254
7     3133    3133
8     9446    9446
9     6241    6241
10    4922    4922
11    4657    4657
12    5134    5134
13    4947    4947
14    5988    5988
15    1376    1376
16    0291    0291
17    1515    1515
18    3126    3126
19    0853    0853
20    2768    2768
21    6738    6738
22    8168    8168
23    0181    0181
24    6760    6760
25    2199    2199
26    2207    2207
27    5145    5145
28    8247    8247
29    7646    7646
30    0941    0941
31    1886    1886
32    4981    4981
33    2140    2140
34    6987    6987
35    0326    0326
36    2867    2867
37    4890    4890
38    8625    8625
39    4475    4475
40    0903    0903

####Exercise 2: Strip the extra quotation marks from the column2 and convert to integer

In [32]:
#Your code here
df.number2.str[1:-1]

0     0,589
1     0,578
2     7,779
3     0,139
4     1,687
5     3,246
6     0,254
7     3,133
8     9,446
9     6,241
10    4,922
11    4,657
12    5,134
13    4,947
14    5,988
15    1,376
16    0,291
17    1,515
18    3,126
19    0,853
20    2,768
21    6,738
22    8,168
23    0,181
24    6,760
25    2,199
26    2,207
27    5,145
28    8,247
29    7,646
30    0,941
31    1,886
32    4,981
33    2,140
34    6,987
35    0,326
36    2,867
37    4,890
38    8,625
39    4,475
40    0,903
Name: number2, dtype: object

In [40]:
df.number2
# another way to remove comma
df.number2.str.strip(",")## why does this not work?

0     '0,589'
1     '0,578'
2     '7,779'
3     '0,139'
4     '1,687'
5     '3,246'
6     '0,254'
7     '3,133'
8     '9,446'
9     '6,241'
10    '4,922'
11    '4,657'
12    '5,134'
13    '4,947'
14    '5,988'
15    '1,376'
16    '0,291'
17    '1,515'
18    '3,126'
19    '0,853'
20    '2,768'
21    '6,738'
22    '8,168'
23    '0,181'
24    '6,760'
25    '2,199'
26    '2,207'
27    '5,145'
28    '8,247'
29    '7,646'
30    '0,941'
31    '1,886'
32    '4,981'
33    '2,140'
34    '6,987'
35    '0,326'
36    '2,867'
37    '4,890'
38    '8,625'
39    '4,475'
40    '0,903'
Name: number2, dtype: object

In [44]:
## str.lstrip can be use to remove an element on the left and rstrip on the right... what about the middle?
df.number2.str.rstrip("'").str.lstrip("'")

0     0,589
1     0,578
2     7,779
3     0,139
4     1,687
5     3,246
6     0,254
7     3,133
8     9,446
9     6,241
10    4,922
11    4,657
12    5,134
13    4,947
14    5,988
15    1,376
16    0,291
17    1,515
18    3,126
19    0,853
20    2,768
21    6,738
22    8,168
23    0,181
24    6,760
25    2,199
26    2,207
27    5,145
28    8,247
29    7,646
30    0,941
31    1,886
32    4,981
33    2,140
34    6,987
35    0,326
36    2,867
37    4,890
38    8,625
39    4,475
40    0,903
Name: number2, dtype: object

In [45]:
## split works perfectly
df.number2.str.split(",")

0     ['0, 589']
1     ['0, 578']
2     ['7, 779']
3     ['0, 139']
4     ['1, 687']
5     ['3, 246']
6     ['0, 254']
7     ['3, 133']
8     ['9, 446']
9     ['6, 241']
10    ['4, 922']
11    ['4, 657']
12    ['5, 134']
13    ['4, 947']
14    ['5, 988']
15    ['1, 376']
16    ['0, 291']
17    ['1, 515']
18    ['3, 126']
19    ['0, 853']
20    ['2, 768']
21    ['6, 738']
22    ['8, 168']
23    ['0, 181']
24    ['6, 760']
25    ['2, 199']
26    ['2, 207']
27    ['5, 145']
28    ['8, 247']
29    ['7, 646']
30    ['0, 941']
31    ['1, 886']
32    ['4, 981']
33    ['2, 140']
34    ['6, 987']
35    ['0, 326']
36    ['2, 867']
37    ['4, 890']
38    ['8, 625']
39    ['4, 475']
40    ['0, 903']
Name: number2, dtype: object

In [46]:
df.number2.str.strip(",") ## why does "," not work ??

0     '0,589'
1     '0,578'
2     '7,779'
3     '0,139'
4     '1,687'
5     '3,246'
6     '0,254'
7     '3,133'
8     '9,446'
9     '6,241'
10    '4,922'
11    '4,657'
12    '5,134'
13    '4,947'
14    '5,988'
15    '1,376'
16    '0,291'
17    '1,515'
18    '3,126'
19    '0,853'
20    '2,768'
21    '6,738'
22    '8,168'
23    '0,181'
24    '6,760'
25    '2,199'
26    '2,207'
27    '5,145'
28    '8,247'
29    '7,646'
30    '0,941'
31    '1,886'
32    '4,981'
33    '2,140'
34    '6,987'
35    '0,326'
36    '2,867'
37    '4,890'
38    '8,625'
39    '4,475'
40    '0,903'
Name: number2, dtype: object